garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1717.PIC
        <edc:JoinedSFRDef edc:cname="PMADR" edc:desc="" edc:name="PMADR" edc:nzwidth="0x10" edc:_addr="0x191">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMADRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PMADRL" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0x191">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PMADRL" edc:desc="" edc:mask="0xff" edc:name="PMADRL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="-nnnnnnn" edc:cname="PMADRH" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="PMADRH" edc:nzwidth="0x8" edc:por="10000000" edc:_addr="0x192">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PMADRH" edc:desc="" edc:mask="0x7f" edc:name="PMADRH" edc:nzwidth="7"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PMDAT" edc:desc="" edc:name="PMDAT" edc:nzwidth="0x10" edc:_addr="0x193">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMDATL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PMDATL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0x193">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PMDATL" edc:desc="" edc:mask="0xff" edc:name="PMDATL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="--nnnnnn" edc:cname="PMDATH" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="PMDATH" edc:nzwidth="0x8" edc:por="--xxxxxx" edc:_addr="0x194">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PMDATH" edc:desc="" edc:mask="0x3f" edc:name="PMDATH" edc:nzwidth="0x6"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="-nnnnnss" edc:cname="PMCON1" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1000q000" edc:name="PMCON1" edc:nzwidth="0x8" edc:por="1000x000" edc:_addr="0x195">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD" edc:desc="Read Control bit" edc:mask="0x1" edc:name="RD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WR" edc:desc="Write Control bit" edc:mask="0x1" edc:name="WR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WREN" edc:desc="Program/Erase Enable bit" edc:mask="0x1" edc:name="WREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WRERR" edc:desc="Sequence Error Flag bit" edc:mask="0x1" edc:name="WRERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FREE" edc:desc="Program FLASH Erase Enable bit" edc:mask="0x1" edc:name="FREE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LWLO" edc:desc="Load Write Latches Only bit" edc:mask="0x1" edc:name="LWLO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CFGS" edc:desc="FLASH Program / Data EEPROM or Configuration Select bit" edc:mask="0x1" edc:name="CFGS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="wwwwwwww" edc:cname="PMCON2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PMCON2" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0x196">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PMCON2" edc:desc="" edc:mask="0xff" edc:name="PMCON2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nr" edc:cname="VREGCON" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------01" edc:name="VREGCON" edc:nzwidth="8" edc:por="------01" edc:_addr="0x197">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="Reserved" edc:desc="" edc:mask="0x1" edc:name="Reserved" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VREGPM" edc:desc="" edc:mask="0x1" edc:name="VREGPM" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x198"/>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RC1REG" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="RC1REG" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01499.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x199">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="RCREG"/>
            <edc:LegacyAlias edc:cname="RCREG1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC1REG" edc:desc="" edc:mask="0xff" edc:name="RC1REG" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TX1REG" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="TX1REG" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01499.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x19A">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TXREG1"/>
            <edc:LegacyAlias edc:cname="TXREG"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TX1REG" edc:desc="" edc:mask="0xff" edc:name="TX1REG" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="SP1BRG" edc:desc="" edc:name="SP1BRG" edc:nzwidth="0x10" edc:_modsrc="DOS-01499.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x19B">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="SPBRG"/>
          </edc:AliasList>
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SP1BRGL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SP1BRGL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01499.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x19B">
            <edc:AliasList>
              <edc:LegacyAlias edc:cname="SPBRG1"/>
              <edc:LegacyAlias edc:cname="SPBRGL"/>
            </edc:AliasList>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SP1BRGL" edc:desc="" edc:mask="0xff" edc:name="SP1BRGL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
