garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1717.PIC
        <edc:AdjustPoint edc:offset="3" edc:_addr="0x512"/>
        <edc:SFRDef edc:access="nn-n--nn" edc:cname="OPA2CON" edc:desc="" edc:impl="0xd3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-0--00" edc:name="OPA2CON" edc:nzwidth="8" edc:por="00-0--00" edc:_modsrc="DOS-02418_amp_opamp_hvpump_v2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x1" edc:_addr="0x515">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OPA2CH" edc:desc="" edc:mask="0x3" edc:name="OPA2CH" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="OPA2UG" edc:desc="" edc:mask="0x1" edc:name="OPA2UG" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPA2SP" edc:desc="" edc:mask="0x1" edc:name="OPA2SP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPA2EN" edc:desc="" edc:mask="0x1" edc:name="OPA2EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OPA2CH0" edc:desc="" edc:mask="0x1" edc:name="OPA2CH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPA2CH1" edc:desc="" edc:mask="0x1" edc:name="OPA2CH1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA2PCH" edc:mask="0x3" edc:name="OPA2PCH" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA2PCH0" edc:desc="" edc:mask="0x1" edc:name="OPA2PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPA2PCH1" edc:desc="" edc:mask="0x1" edc:name="OPA2PCH1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="11" edc:beginaddr="0x580" edc:endaddr="0x5A0" edc:regionid="sfr11">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x580"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="12" edc:beginaddr="0x600" edc:endaddr="0x620" edc:regionid="sfr12">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x600"/>
        <edc:AdjustPoint edc:offset="11" edc:_addr="0x60C"/>
        <edc:SFRDef edc:access="nn------" edc:cname="PWM3DCL" edc:desc="" edc:impl="0xc0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu------" edc:name="PWM3DCL" edc:nzwidth="8" edc:por="xx------" edc:_modsrc="DOS-01435.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x617">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM3DCL" edc:desc="" edc:mask="0x3" edc:name="PWM3DCL" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM3DCL0" edc:desc="" edc:mask="0x1" edc:name="PWM3DCL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3DCL1" edc:desc="" edc:mask="0x1" edc:name="PWM3DCL1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3DCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM3DCH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-01435.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x618">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PWM3DCH" edc:desc="" edc:mask="0xff" edc:name="PWM3DCH" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM3DCH0" edc:desc="" edc:mask="0x1" edc:name="PWM3DCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3DCH1" edc:desc="" edc:mask="0x1" edc:name="PWM3DCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3DCH2" edc:desc="" edc:mask="0x1" edc:name="PWM3DCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3DCH3" edc:desc="" edc:mask="0x1" edc:name="PWM3DCH3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3DCH4" edc:desc="" edc:mask="0x1" edc:name="PWM3DCH4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3DCH5" edc:desc="" edc:mask="0x1" edc:name="PWM3DCH5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3DCH6" edc:desc="" edc:mask="0x1" edc:name="PWM3DCH6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3DCH7" edc:desc="" edc:mask="0x1" edc:name="PWM3DCH7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-rn----" edc:cname="PWM3CON" edc:desc="Configurable logic cell control" edc:impl="0xb0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-x0----" edc:name="PWM3CON" edc:nzwidth="8" edc:por="0-x0----" edc:_modsrc="DOS-01435.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x619">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PWM3CON0"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM3POL" edc:desc="" edc:mask="0x1" edc:name="PWM3POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3OUT" edc:desc="" edc:mask="0x1" edc:name="PWM3OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM3EN" edc:desc="" edc:mask="0x1" edc:name="PWM3EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn------" edc:cname="PWM4DCL" edc:desc="" edc:impl="0xc0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu------" edc:name="PWM4DCL" edc:nzwidth="8" edc:por="xx------" edc:_modsrc="DOS-01435.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x61A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM4DCL" edc:desc="" edc:mask="0x3" edc:name="PWM4DCL" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM4DCL0" edc:desc="" edc:mask="0x1" edc:name="PWM4DCL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM4DCL1" edc:desc="" edc:mask="0x1" edc:name="PWM4DCL1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM4DCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM4DCH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-01435.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x61B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PWM4DCH" edc:desc="" edc:mask="0xff" edc:name="PWM4DCH" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM4DCH0" edc:desc="" edc:mask="0x1" edc:name="PWM4DCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM4DCH1" edc:desc="" edc:mask="0x1" edc:name="PWM4DCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM4DCH2" edc:desc="" edc:mask="0x1" edc:name="PWM4DCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM4DCH3" edc:desc="" edc:mask="0x1" edc:name="PWM4DCH3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM4DCH4" edc:desc="" edc:mask="0x1" edc:name="PWM4DCH4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM4DCH5" edc:desc="" edc:mask="0x1" edc:name="PWM4DCH5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM4DCH6" edc:desc="" edc:mask="0x1" edc:name="PWM4DCH6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM4DCH7" edc:desc="" edc:mask="0x1" edc:name="PWM4DCH7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-rn----" edc:cname="PWM4CON" edc:desc="Configurable logic cell control" edc:impl="0xb0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-x0----" edc:name="PWM4CON" edc:nzwidth="8" edc:por="0-x0----" edc:_modsrc="DOS-01435.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x61C">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PWM4CON0"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM4POL" edc:desc="" edc:mask="0x1" edc:name="PWM4POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM4OUT" edc:desc="" edc:mask="0x1" edc:name="PWM4OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM4EN" edc:desc="" edc:mask="0x1" edc:name="PWM4EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="13" edc:beginaddr="0x680" edc:endaddr="0x6A0" edc:regionid="sfr13">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x680"/>
        <edc:AdjustPoint edc:offset="5" edc:_addr="0x68C"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG1PHR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="COG1PHR" edc:nzwidth="8" edc:por="--xxxxxx" edc:_modsrc="DOS-02429_cog_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x691">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1PHR" edc:desc="" edc:mask="0x3f" edc:name="G1PHR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1PHR0" edc:desc="" edc:mask="0x1" edc:name="G1PHR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHR1" edc:desc="" edc:mask="0x1" edc:name="G1PHR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHR2" edc:desc="" edc:mask="0x1" edc:name="G1PHR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHR3" edc:desc="" edc:mask="0x1" edc:name="G1PHR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHR4" edc:desc="" edc:mask="0x1" edc:name="G1PHR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHR5" edc:desc="" edc:mask="0x1" edc:name="G1PHR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG1PHF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="COG1PHF" edc:nzwidth="8" edc:por="--xxxxxx" edc:_modsrc="DOS-02429_cog_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x692">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1PHF" edc:desc="" edc:mask="0x3f" edc:name="G1PHF" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1PHF0" edc:desc="" edc:mask="0x1" edc:name="G1PHF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHF1" edc:desc="" edc:mask="0x1" edc:name="G1PHF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHF2" edc:desc="" edc:mask="0x1" edc:name="G1PHF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHF3" edc:desc="" edc:mask="0x1" edc:name="G1PHF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHF4" edc:desc="" edc:mask="0x1" edc:name="G1PHF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHF5" edc:desc="" edc:mask="0x1" edc:name="G1PHF5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG1BLKR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="COG1BLKR" edc:nzwidth="8" edc:por="--xxxxxx" edc:_modsrc="DOS-02429_cog_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x693">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1BLKR" edc:desc="" edc:mask="0x3f" edc:name="G1BLKR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1BLKR0" edc:desc="" edc:mask="0x1" edc:name="G1BLKR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKR1" edc:desc="" edc:mask="0x1" edc:name="G1BLKR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKR2" edc:desc="" edc:mask="0x1" edc:name="G1BLKR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKR3" edc:desc="" edc:mask="0x1" edc:name="G1BLKR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKR4" edc:desc="" edc:mask="0x1" edc:name="G1BLKR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKR5" edc:desc="" edc:mask="0x1" edc:name="G1BLKR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG1BLKF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="COG1BLKF" edc:nzwidth="8" edc:por="--xxxxxx" edc:_modsrc="DOS-02429_cog_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x694">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1BLKF" edc:desc="" edc:mask="0x3f" edc:name="G1BLKF" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1BLKF0" edc:desc="" edc:mask="0x1" edc:name="G1BLKF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKF1" edc:desc="" edc:mask="0x1" edc:name="G1BLKF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKF2" edc:desc="" edc:mask="0x1" edc:name="G1BLKF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKF3" edc:desc="" edc:mask="0x1" edc:name="G1BLKF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKF4" edc:desc="" edc:mask="0x1" edc:name="G1BLKF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKF5" edc:desc="" edc:mask="0x1" edc:name="G1BLKF5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG1DBR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="COG1DBR" edc:nzwidth="8" edc:por="--xxxxxx" edc:_modsrc="DOS-02429_cog_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x695">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1DBR" edc:desc="" edc:mask="0x3f" edc:name="G1DBR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1DBR0" edc:desc="" edc:mask="0x1" edc:name="G1DBR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBR1" edc:desc="" edc:mask="0x1" edc:name="G1DBR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBR2" edc:desc="" edc:mask="0x1" edc:name="G1DBR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBR3" edc:desc="" edc:mask="0x1" edc:name="G1DBR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBR4" edc:desc="" edc:mask="0x1" edc:name="G1DBR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBR5" edc:desc="" edc:mask="0x1" edc:name="G1DBR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG1DBF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="COG1DBF" edc:nzwidth="8" edc:por="--xxxxxx" edc:_modsrc="DOS-02429_cog_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x696">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1DBF" edc:desc="" edc:mask="0x3f" edc:name="G1DBF" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1DBF0" edc:desc="" edc:mask="0x1" edc:name="G1DBF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBF1" edc:desc="" edc:mask="0x1" edc:name="G1DBF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBF2" edc:desc="" edc:mask="0x1" edc:name="G1DBF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBF3" edc:desc="" edc:mask="0x1" edc:name="G1DBF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBF4" edc:desc="" edc:mask="0x1" edc:name="G1DBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBF5" edc:desc="" edc:mask="0x1" edc:name="G1DBF5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
