garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1717.PIC
    <edc:RemappablePin edc:direction="out" edc:ppsports="A E">
      <edc:VirtualPin edc:name="C1OUT" edc:ppsval="0x16"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A D">
      <edc:VirtualPin edc:name="C2OUT" edc:ppsval="0x17"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CCP1" edc:ppsval="0x0C"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CCP1" edc:ppsval="0x0C"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CCP2" edc:ppsval="0x0D"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CCP2" edc:ppsval="0x0D"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="T1G"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="T1CKI"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B">
      <edc:VirtualPin edc:name="T0CKI"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A D">
      <edc:VirtualPin edc:name="NCO1OUT" edc:ppsval="0x03"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B E">
      <edc:VirtualPin edc:name="PWM3OUT" edc:ppsval="0x0E"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="PWM4OUT" edc:ppsval="0x0F"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B D">
      <edc:VirtualPin edc:name="COGIN"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="COG1A" edc:ppsval="0x08"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="COG1B" edc:ppsval="0x09"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="COG1C" edc:ppsval="0x0A"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="COG1D" edc:ppsval="0x0B"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SDA" edc:ppsval="0x11"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SDA" edc:ppsval="0x11"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SDI"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SCK"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SCK" edc:ppsval="0x10"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SCL"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SCL" edc:ppsval="0x10"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SDO" edc:ppsval="0x11"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A D">
      <edc:VirtualPin edc:name="SS"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="RX"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="DT" edc:ppsval="0x15"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="TX" edc:ppsval="0x14"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CK"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CK" edc:ppsval="0x14"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="CLCIN0"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="CLCIN1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B D">
      <edc:VirtualPin edc:name="CLCIN2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B D">
      <edc:VirtualPin edc:name="CLCIN3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="CLC4OUT" edc:ppsval="0x07"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B D">
      <edc:VirtualPin edc:name="CLC3OUT" edc:ppsval="0x06"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="CLC2OUT" edc:ppsval="0x05"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="CLC1OUT" edc:ppsval="0x04"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B">
      <edc:VirtualPin edc:name="INT"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A D">
      <edc:VirtualPin edc:name="NCOOUT" edc:ppsval="0x03"/>
    </edc:RemappablePin>
  </edc:PinList>
</edc:PIC>
